# ================================
# 2024.06.08 comseba-r-adsp
# ================================

# 직접 명령문1
# 거듭제곱
2 ^ 3

# 곱셈
2 * 3

# 나눗셈
3 / 3

# 덧셈
3 + 3

# 뺄셈
3 - 3

# 실행 결과
# > 2 ^ 3
# [1] 8
# > 2 * 3
# [1] 6
# > 3 / 3
# [1] 1
# > 3 + 3
# [1] 6
# > 3 - 3
# [1] 0

# 직접 명령문2
# 소수점 4번째 자리까지 출력
print(2 ^ 0.5, digits = 5)
print(2 * 3, digits = 5)
print(2 / 3, digits = 5)
print(3 + 3, digits = 5)
print(3 - 3, digits = 5)

# 실행 결과
# > print(2 ^ 0.5, digits = 5)
# [1] 1.4142
# > print(2 * 3, digits = 5)
# [1] 6
# > print(2 / 3, digits = 5)
# [1] 0.66667
# > print(3 + 3, digits = 5)
# [1] 6
# > print(3 - 3, digits = 5)
# [1] 0

# 할당 명령문
# 제안
x <- c(1, 2, 3, 4, 5)
x

# 제안 2
c(1, 2, 3, 4, 5) -> x
x

# 추천
x = c(1, 2, 3, 4, 5)
x

# 1부터 10까지 1씩 증가
y = c(1:10)

# x: 1 2 3 4  5 1 2 3 4  5
# y: 1 2 3 4  5 6 7 8 9 10
# z: 2 4 6 8 10 ...

z = x + y
z


# 할당 명령문2
assign("x", c(1, 2, 3, 4, 5))
x

assign("y", c(1:10))
y

assign("z", x + y)
z

# 수학함수
a = c(-3, -2, -1, 1, 2, 3)

# 총계
sum(a)

# 절대값 양수
abs(a)

as = a[4:6]

# 루트
sqrt(as)

# 최대값
max(a)

# 최소값
min(a)

# 범위
range(a)

# 
exp(a)

# e로그
log(as)

# 10로그
log10(as)


# 수학함수2
x = c(21, 4, 13, 6, 12, 7, 4, 25, 22)
y = c(-2, 4, -3, 8, -7, 8, -2, -6, 5)

# 개별 출력
x
y

# 동시 출력
x ; y

# 공분산
cov(x, y)

# 상관계수
cor(x, y)

# x 기초통계량
# 최소값, 1분위수, 중앙값, 평균값, 3분위수, 최대값
summary(x)

# y 기초통계량
summary(y)

# 1~10까지 누적합
cumsum(1:10)

# 1~10까지 누적곱
cumprod(1:10)
